prompts = {
    "const": ",и, это важно, выведите ТОЛЬКО три подряд идущих коэфициента без какого либо текста, разденных знаком $",
    "solvability": ",важно, чтобы при подстановке в формулу b ** 2 - (4 * a * c) полученных коэффиицентов получалось положительное число с целочисленным корнем",
    "quadratic_equations1": "Сгенерируйте простое квадратное уравнение без дробей",
    "quadratic_equations2": "Сгенерируйте квадратное уравнение, включающее дробные коэффициенты",
    "quadratic_equations3": "Сгенерируйте квадратное уравнение, включающее коэффициенты с высокими значениями и дробные коэффициенты",
    "quadratic_equations4": "Сгенерируйте квадратное уравнение с использованием высших математических концепций, например, квадратные уравнения с комплексными корнями или уравнения с высокими степенями"
}

# 3 and 4 is not for use now!